lvx/base/Documents/бит_пз_ОтражениеФактаЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_пз_ОтражениеФактаЗатрат</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_ОборотыПоБюджетам</xr:Item>
				<xr:Item>AccumulationRegister.бит_пз_ПланируемыеЗатраты</xr:Item>
				<xr:Item>AccountingRegister.бит_Бюджетирование</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_пз_ВидыОперацийЗаявокНаЗатраты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_пз_ЗаявкаНаЗатраты</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_пз_СводнаяЗаявкаНаЗатраты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Comment>Ручная корректировка - служебный реквизит</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Comment>Курс документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьДокумента</Name>
					<Comment>Кратность документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗаявкиНаЗатраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаявкаНаЗатраты</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бит_пз_ЗаявкаНаЗатраты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяОборотов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_4</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_5</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_6</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_7</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_8</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_9</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_10</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_11</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_12</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСтавкаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СтавкаНДС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.бит_СтавкаНДС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

lvx/base/Documents/бит_пз_ОтражениеФактаЗатрат/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений();
	
	Если Параметры.Свойство("ДокументОснование") Тогда
	
		Если ЗначениеЗаполнено(Параметры.ДокументОснование) Тогда
			ДокОбъект = РеквизитФормыВЗначение("Объект");
			ДокОбъект.Заполнить(Параметры.ДокументОснование);
			ЗначениеВДанныеФормы(ДокОбъект, Объект);
			ЗаполнитьКоличествоПредыдущее();
			РасчитатьСуммыТабличнойЧасти();
		КонецЕсли; 
				
	КонецЕсли; 
	
	Если Параметры.Ключ.Пустая() Тогда
		УстановитьСостояниеДокумента();
	КонецЕсли;
	
	// Настроим отображение полей доп. аналитик в форме.
	бит_МеханизмДопИзмерений.ПоказатьДополнительныеИзмеренияВТабличномПоле(ЭтотОбъект,"ЗаявкиНаЗатраты",
		КэшЗначений.ИзмеренияДоп,КэшЗначений.НастройкиИзмерений);
																					
	ОФормитьТаблицу("ЗаявкиНаЗатраты");
																					
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	 
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УправлениеЭлементамиФормы();
	УстановитьСостояниеДокумента();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	УстановитьСостояниеДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	
	ДокументОснованиеПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеОчистка(Элемент, СтандартнаяОбработка)
	
	ОФормитьТаблицу("ЗаявкиНаЗатраты");
	Объект.ЗаявкиНаЗатраты.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаДокументаПриИзменении(Элемент)
	
	ВалютаДокументаПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ТекстСообщения = НСтр("ru='Поле ""Организация"" не заполнено';
							  |en='The ""Organization"" is not filled'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, "Объект.Организация");
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ВалютаДокумента) Тогда
		ТекстСообщения = НСтр("ru='Поле ""Валюта"" не заполнено';
							  |en='The ""Currency"" not filled'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, "Объект.ВалютаДокумента");
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТабличнойЧасти

&НаКлиенте
Процедура ЗаявкиНаЗатратыКоличествоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ЗаявкиНаЗатраты.ТекущиеДанные;
	ПриИзмененииКоличествоЦена(СтрокаТабличнойЧасти.Сумма
								, СтрокаТабличнойЧасти.Количество
								, СтрокаТабличнойЧасти.Цена
								, СтрокаТабличнойЧасти.СуммаНДС
								, СтрокаТабличнойЧасти.СуммаСНДС
								, СтрокаТабличнойЧасти.СтавкаНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиНаЗатратыСуммаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ЗаявкиНаЗатраты.ТекущиеДанные;
	
	ПриИзмененииСумма(СтрокаТабличнойЧасти.Сумма
						, СтрокаТабличнойЧасти.СуммаНДС
						, СтрокаТабличнойЧасти.СуммаСНДС
						, СтрокаТабличнойЧасти.СтавкаНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиНаЗатратыЦенаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ЗаявкиНаЗатраты.ТекущиеДанные;
	ПриИзмененииКоличествоЦена(СтрокаТабличнойЧасти.Сумма
								, СтрокаТабличнойЧасти.Количество
								, СтрокаТабличнойЧасти.Цена
								, СтрокаТабличнойЧасти.СуммаНДС
								, СтрокаТабличнойЧасти.СуммаСНДС
								, СтрокаТабличнойЧасти.СтавкаНДС);
								
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиНаЗатратыСтавкаНДСПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	ТоварыСтавкаНДСПриИзмененииСервер(СтрокаТабличнойЧасти.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиНаЗатратыСуммаНДСПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	РассчитатьСуммуВсего(СтрокаТабличнойЧасти.СуммаСНДС, СтрокаТабличнойЧасти.Сумма, СтрокаТабличнойЧасти.СуммаНДС);									
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиНаЗатратыСтатьяОборотовПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.ЗаявкиНаЗатраты.ТекущиеДанные;
		
	бит_МеханизмДопИзмеренийКлиент.ИнициализироватьЗначенияДопИзмерений(СтрокаТЧ, КэшЗначений.ИзмеренияДоп, КэшЗначений.НастройкиИзмерений);
	
	ИзменениеСтатьиОборотовТабличнойЧасти(СтрокаТЧ.ПолучитьИдентификатор());
	
КонецПроцедуры

// Процедура - обработчик события "НачалоВыбора" полей ввода "Аналитика_<N>".
//
&НаКлиенте
Процедура ЗаявкиНаЗатратыАналитика_НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ЗаявкиНаЗатраты.ТекущиеДанные;
	ИмяАналитики  = СтрЗаменить(Элемент.Имя, "ЗаявкиНаЗатраты", "");
	
	бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(ЭтотОбъект
	                                                      	   ,Элемент
															   ,ТекущиеДанные
															   ,ИмяАналитики
															   ,СтандартнаяОбработка
															   ,КэшЗначений.НастройкиИзмерений);
	
КонецПроцедуры // ЗаявкиНаЗатратыАналитика_НачалоВыбора()

// Процедура - обработчик события "АвтоПодбор" полей ввода "Аналитика_<N>".
//
&НаКлиенте
Процедура ЗаявкиНаЗатратыАналитика_АвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
    
    ТекущиеДанные = Элементы.ЗаявкиНаЗатраты.ТекущиеДанные;
	ИмяАналитики  = СтрЗаменить(Элемент.Имя, "ЗаявкиНаЗатраты", "");
	
	бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(ЭтотОбъект
	                                                      	   ,Элемент
															   ,ТекущиеДанные
															   ,ИмяАналитики
															   ,СтандартнаяОбработка
															   ,КэшЗначений.НастройкиИзмерений);
                                                               
КонецПроцедуры // ЗаявкиНаЗатратыАналитика_АвтоПодбор()

// Процедура - обработчик события "Очистка" полей ввода "Аналитика_<N>".
//
&НаКлиенте
Процедура ЗаявкиНаЗатратыАналитика_Очистка(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ЗаявкиНаЗатраты.ТекущиеДанные;
	ИмяАналитики  = СтрЗаменить(Элемент.Имя, "ЗаявкиНаЗатраты", "");
	
	бит_МеханизмДопИзмеренийКлиент.ОбработкаОчисткиДополнительногоИзмерения(Элемент
																			,ТекущиеДанные
	                                                                       	,ИмяАналитики
																		   	,СтандартнаяОбработка
																		   	,КэшЗначений.НастройкиИзмерений);
	
КонецПроцедуры // ЗаявкиНаЗатратыАналитика_Очистка()

#КонецОбласти 

#Область ОбработчикиКомандФормы

#Область СтандартныеПодсистемыОбработчикиКоманд

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(Знач ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти 

#Область ПроцедурыИФункцииОбщегоНазначения

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = бит_ОбщегоНазначения.СостояниеДокумента(Объект);
	
КонецПроцедуры

//  Процедура заполняет кэш значений, необходимый при работе на клиенте.
// 
&НаСервере
Процедура ЗаполнитьКэшЗначений()
	
	КэшЗначений = Новый Структура;
	
	ДокументЗаявка = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.бит_пз_ОтражениеФактаЗатрат"));
	
	КэшЗначений.Вставить("ИзмеренияДоп"      	, ДокументЗаявка.мИзмеренияДоп);
	КэшЗначений.Вставить("НастройкиИзмерений"	, ДокументЗаявка.мНастройкиИзмерений);
	КэшЗначений.Вставить("ВалютаРеглУчета"		, Константы.ВалютаРегламентированногоУчета.Получить());
	// Произвольные измерения
	КэшЗначений.Вставить("Измерения"			, бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Произвольные", "Синоним"));
	
	// Запишем параметр для формирования заголовка.
	КэшЗначений.Вставить("ПредставлениеОбъекта", Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	
	// Параметры, используемые для управления автовидимостью колонок.
	КэшЗначений.Вставить("МассивСтатей_ЗаявкиНаЗатраты", Новый Массив);
	КэшЗначений.Вставить("НастройкаВидимостиКолонок"	, Новый Структура);
	
КонецПроцедуры // ЗаполнитьКэшЗначений()

//  Процедура управляем видимостью-доступностью элементов формы. 
// 
&НаСервере
Процедура УправлениеЭлементамиФормы()

	Элементы.ГруппаИнфо.Видимость = НЕ ЗначениеЗаполнено(Объект.ДокументОснование);
	
	Если НЕ Объект.Проведен Тогда 
		
		УстановитьДоступностьЭлементов(Истина, Истина);
	
	Иначе 
		
		УстановитьДоступностьЭлементов(Ложь, Истина);
		
	КонецЕсли; 
	
КонецПроцедуры // УправлениеЭлементамиФормы()

//  Процедура обработчик ПриИзменении документа основания на сервере.
//
&НаСервере
Процедура ДокументОснованиеПриИзмененииСервер()

	Если НЕ ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
	
		Возврат;
	
	КонецЕсли; 
	
	Документы.бит_пз_ОтражениеФактаЗатрат.ЗаполнитьОтражениеФактаПоОснованию(Объект, Объект.ДокументОснование);
	
	ЗаполнитьКоличествоПредыдущее();
	РасчитатьСуммыТабличнойЧасти();
	
	ОФормитьТаблицу("ЗаявкиНаЗатраты");
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры // ДокументОснованиеПриИзмененииСервер()

//  Процедура устанавливает данные в строке табличной 
// части в зависимости от настроек статьи оборотов. 
//
// Параметры:
//  ТекущиеДанные - СтрокаТабличнойЧасти.
//
&НаСервере
Процедура УстановитьДанныеПоСтатье(ТекущиеДанные)

	НастройкиСтатьи = Справочники.бит_СтатьиОборотов.ПолучитьНастройки(ТекущиеДанные.СтатьяОборотов);
	
	бит_Бюджетирование.УстановитьИспользованиеАналитики(ТекущиеДанные, НастройкиСтатьи, КэшЗначений.Измерения);
	
КонецПроцедуры // УстановитьДанныеПоСтатье()

//  Процедура обрабатывает изменение реквизита "СтатьяОборотов" в табличной части "ЗаявкиНаЗатраты".
// 
// Параметры:
//  ТекИд - Число
// 
&НаСервере
Процедура ИзменениеСтатьиОборотовТабличнойЧасти(ТекИд)
	
	ТекущиеДанные = Объект.ЗаявкиНаЗатраты.НайтиПоИдентификатору(ТекИд);
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьДанныеПоСтатье(ТекущиеДанные);
	
	ОФормитьТаблицу("ЗаявкиНаЗатраты", ТекущиеДанные.СтатьяОборотов);		
	УстановитьАвтовидимостьКолонок();
	
КонецПроцедуры // ИзменениеСтатьиОборотовТабличнойЧасти()

//  Процедура оформляет табличное поле в соответствии со статьей оборотов.
// 
// Параметры:
//  ПрефиксТаблицы 	- Строка
//  СтатьяОборотов 	- СправочникСсылка.бит_СтатьиОборотов
// 
&НаСервере
Процедура ОФормитьТаблицу(ПрефиксТаблицы, СтатьяОборотов = Неопределено) 
	
	//// ----------------------------------------------------------------------
	//// Оформление реквизитов строк по статьям оборотов
	//УдалитьСтароеОформление = Ложь;
	//ПрефиксКонтейнера = "Объект.";
	//
	//Если СтатьяОборотов = Неопределено Тогда
	//
	//	УдалитьСтароеОформление = Истина;
	//
	//	// Формирование массива статей, по которым нужно добавить элементы УО.
	//	ТаблицаПоиска = Объект[ПрефиксТаблицы].Выгрузить();
	//	МассивСтатей = ТаблицаПоиска.ВыгрузитьКолонку("СтатьяОборотов");
	//	бит_РаботаСКоллекциями.УдалитьПовторяющиесяЭлементыМассива(МассивСтатей);
	//	
	//	ЭтотОбъект["фСписокСтатей" + ПрефиксТаблицы].ЗагрузитьЗначения(МассивСтатей);
	//	
	//Иначе // Работаем только с одной статьей оборотов		
	//	
	//	МассивСтатей = Новый Массив; 		
	//	
	//	НайденноеЗначение = ЭтотОбъект["фСписокСтатей" + ПрефиксТаблицы].НайтиПоЗначению(СтатьяОборотов);
	//	Если НайденноеЗначение = Неопределено Тогда	
	//		
	//		МассивСтатей.Добавить(СтатьяОборотов);
	//		ЭтотОбъект["фСписокСтатей" + ПрефиксТаблицы].Добавить(СтатьяОборотов);		
	//		
	//	КонецЕсли;  		
	//	
	//КонецЕсли;	
	//
	//ДопПараметры = Новый Структура;
	//ДопПараметры.Вставить("ОтметитьОбязательныеРазрезыСтатей", Истина);
	//
	//ПараметрыОформления = бит_РаботаСДиалогамиСервер.ПараметрыОформленияСтатей();
	//ПараметрыОформления.ПрефиксКонтейнера = ПрефиксКонтейнера;
	//ПараметрыОформления.ПрефиксТаблицы    = ПрефиксТаблицы;
	//бит_РаботаСДиалогамиСервер.ОформитьТаблицуПоСтатьямОборотов(УсловноеОформление, МассивСтатей, УдалитьСтароеОформление,
			//ПараметрыОформления,,, ДопПараметры);
	
КонецПроцедуры // ОФормитьТаблицу()

//  Процедура устанавливает автоматически видимость колонок таблицы БДДС.
// 
// Параметры:
//  ОбновлятьБезусловно - Булево (по умолчанию = Ложь)
// 
&НаСервере
Процедура УстановитьАвтовидимостьКолонок(ОбновлятьБезусловно = Ложь)
	
	ИмяТабличнойЧасти = "ЗаявкиНаЗатраты";
	ИмяМассива = "МассивСтатей_" + ИмяТабличнойЧасти;
	
	ТаблРез = Объект[ИмяТабличнойЧасти].Выгрузить();
	МассивСтатей = ТаблРез.ВыгрузитьКолонку("СтатьяОборотов");
	НеобходимоИзменение = бит_РаботаСДиалогамиСервер.НужноИзменитьВидимостьКолонокБюджета(МассивСтатей
																	, КэшЗначений[ИмяМассива]
																	, КэшЗначений.НастройкаВидимостиКолонок);
	
	Если НеобходимоИзменение Тогда
		
		бит_РаботаСДиалогамиСервер.УправлениеВидимостьюКолонокТабличногоПоля(Элементы
										 				, КэшЗначений.НастройкаВидимостиКолонок
										 				, ИмяТабличнойЧасти);
					
	КонецЕсли; 
		
КонецПроцедуры // УстановитьАвтовидимостьКолонок()

//  Процедура при изменении валюты на сервере. 
//
&НаСервере
Процедура ВалютаДокументаПриИзмененииСервер()

	Объект.ЗаявкиНаЗатраты.Очистить();
	
	ДокументЗаявка = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.бит_пз_ОтражениеФактаЗатрат"));
	ДокументЗаявка.ИзменениеВалютыМодуль();
	
	ЗначениеВДанныеФормы(ДокументЗаявка, Объект);

КонецПроцедуры // ВалютаДокументаПриИзмененииСервер()

//  Процедура заполняет у таблицы Заявки предыдущее количество.
//
&НаСервере
Процедура ЗаполнитьКоличествоПредыдущее()

	Для каждого СтрокаТабличнойЧасти Из Объект.ЗаявкиНаЗатраты Цикл
	
		СтрокаТабличнойЧасти.КоличествоПредыдущее = СтрокаТабличнойЧасти.Количество;
	
	КонецЦикла; 

КонецПроцедуры // ЗаполнитьКоличествоПредыдущее()

//  Процедура расчитывает недостающие суммы после загрузки из документа основание.
//
&НаСервере
Процедура РасчитатьСуммыТабличнойЧасти()

	Для каждого СтрокаТабличнойЧасти Из Объект.ЗаявкиНаЗатраты Цикл
	
		Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.СтавкаНДС) Тогда
			СтрокаТабличнойЧасти.СуммаНДС = бит_БухгалтерияКлиентСервер.РассчитатьСуммуНДС(СтрокаТабличнойЧасти.Сумма,
				Истина, Ложь, бит_БухгалтерскийУчет.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС));
		КонецЕсли;
		
		РассчитатьСуммуВсего(СтрокаТабличнойЧасти.СуммаСНДС, СтрокаТабличнойЧасти.Сумма, СтрокаТабличнойЧасти.СуммаНДС);									
	
	КонецЦикла; 

КонецПроцедуры // РасчитатьСуммыТабличнойЧасти()

//  Процедура устанавливает доступность элементам формы.
// 
// Параметры:
//  Доступность - Булево.
// 
&НаСервере
Процедура УстановитьДоступностьЭлементов(Доступность, ИспользоватьИсключения)

	Исключения = Новый Массив;
	Если ИспользоватьИсключения Тогда
		
		Исключения.Добавить(ВРег("ЗаявкиНаЗатратыЗаявкаНаЗатраты"));
	
	КонецЕсли;
	
	Для каждого Элемент Из Элементы Цикл
		
		Если ТипЗнч(Элемент) = Тип("ПолеФормы") 
			 И Исключения.Найти(ВРег(Элемент.Имя)) = Неопределено Тогда  
			
			Элемент.ТолькоПросмотр = НЕ Доступность;
			
		КонецЕсли; 
		
	КонецЦикла;

КонецПроцедуры // УстановитьДоступностьЭлементов()

//  Процедура пересчитывает суммы табличной части при изменении цены или количества.
// 
&НаКлиентеНаСервереБезКонтекста
Процедура ПриИзмененииКоличествоЦена(Сумма, Количество, Цена, СуммаНДС, Всего, СтавкаНДС)

	Сумма = Цена * Количество;
	
	СуммаНДС = бит_БухгалтерияКлиентСервер.РассчитатьСуммуНДС(Сумма,
					Истина, Ложь, бит_БухгалтерияВызовСервера.ПолучитьСтавкуНДС(СтавкаНДС));
	
	Всего = Сумма + СуммаНДС;

КонецПроцедуры // ПриИзмененииКоличествоЦена()

//  Процедура пересчитывает суммы табличной части при суммы.
// 
&НаКлиентеНаСервереБезКонтекста
Процедура ПриИзмененииСумма(Сумма, СуммаНДС, Всего, СтавкаНДС)

	СуммаНДС = бит_БухгалтерияКлиентСервер.РассчитатьСуммуНДС(Сумма,
					Истина, Ложь, бит_БухгалтерияВызовСервера.ПолучитьСтавкуНДС(СтавкаНДС));
										
	Всего = Сумма + СуммаНДС;									

КонецПроцедуры // ПриИзмененииСумма()

//  Процедура обработка "ПриИзменении" поля СтавкаНДС на сервере. 
//
&НаСервере
Процедура ТоварыСтавкаНДСПриИзмененииСервер(ИД)

	СтрокаТабличнойЧасти = Объект.ЗаявкиНаЗатраты.НайтиПоИдентификатору(ИД);
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.СтавкаНДС) Тогда
		СтрокаТабличнойЧасти.СуммаНДС = бит_БухгалтерияКлиентСервер.РассчитатьСуммуНДС(СтрокаТабличнойЧасти.Сумма,
			Истина, Ложь, бит_БухгалтерскийУчет.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС));
	КонецЕсли;
	
	РассчитатьСуммуВсего(СтрокаТабличнойЧасти.СуммаСНДС, СтрокаТабличнойЧасти.Сумма, СтрокаТабличнойЧасти.СуммаНДС);									
	
КонецПроцедуры // ТоварыСтавкаНДСПриИзмененииСервер()

//  Процедура считает общую сумму. 
//
&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьСуммуВсего(Всего, Сумма, СуммаНДС)

	Всего = Сумма + СуммаНДС;

КонецПроцедуры // РассчитатьСуммуВсего()

#КонецОбласти
